[
  {
    "title": "Demystifying Machine Learning: A Workshop for Beginners",
    "image_url": "assets/images/events/ML_workshop_banner_with_logo.webp",
    "description": "Unlock the Secrets of Intelligent Machines!\n\nJoin our ML workshop led by Kunal Sahoo, a passionate BTech CSE student, Robotics & AI/ML Head, and GDSC Lead at PDEU. Explore the fascinating world of Machine Learning.",
    "date": "23 Mar, 2024",
    "location": "Auditorium, 5th Floor, Navrachna University",
    "form_link": "",
    "btnText": ""
  },
  {
    "title": "Android Development Workshop",
    "image_url": "assets/images/events/Android-workshop-banner.webp",
    "description": "Join us for the Android Development Workshop, where you'll take your first steps into the exciting world of mobile app creation. Learn the fundamentals of Android development and create your own app in this interactive workshop. No prior experience is needed!",
    "date": "28 Feb, 2024",
    "location": "Auditorium, 5th Floor, Navrachna University",
    "form_link": "",
    "btnText": ""
  },
  {
    "title": "Prompt Engineering Workshop",
    "image_url": "assets/images/events/Prompt-eng-banner.webp",
    "description": "Learn how to write effective prompts to leverage the power of AI for your specific field, from engineering to journalism. This workshop will introduce various prompting techniques and showcase practical applications across disciplines. Gain valuable skills to boost your productivity and unlock the full potential of AI.",
    "date": "28 February 2024",
    "location": "Auditorium, 5th Floor, Building A, Navrachana University",
    "form_link": "",
    "btnText": ""
  },
  {
    "title": "GDSC Lead Info Session",
    "image_url": "assets/images/events/Become a lead - 2.webp",
    "description": "Join this info session to learn more about being a GDSC Lead, how you can apply for the position, and secrets to a successful lead application.",
    "date": "26 Febuary 2024",
    "location": "Online",
    "form_link": "",
    "btnText": ""
  },
  {
    "title": "GDSC Solution Challenge Info Session",
    "image_url": "assets/images/events/dsc-bevy-chapterevents-03_SIPrTRt.webp",
    "description": "Join us for an exciting kickoff to the GDSC Solution Challenge! This event will begin with an introduction to GDSC Solution Challenge and its objectives. Let's explore the world of AI innovation and problem solving.",
    "date": "16 January 2024",
    "location": "Online",
    "form_link": "",
    "btnText": ""
  },
  {
    "title": "Neofest 2.0 - by Neofolks X Hack Club NUV",
    "image_url": "assets/images/events/Luma_nc5yxZ4.webp",
    "description": "Join us at Neofest 2.0, a one-day, beginner-friendly event organized by Neofolks X Hack Club NUV in collaboration with GDSC NUV. Explore the world of open source, get inspired to contribute, and make your first pull request. Enjoy talks, workshops, and surprises!",
    "date": "21 October 2023",
    "location": "Navrachana University",
    "form_link": "",
    "btnText": ""
  },
  {
    "title": "Workshop Series: Crafting Seamless User Experiences with Figma Wireframing and Prototyping",
    "image_url": "assets/images/events/dsc-bevy-chapterevents-03_uDQbTVM.webp",
    "description": "Join us for a hands-on program focused on using Figma for creating user-friendly digital interfaces. This session covers essential UI/UX design concepts, making it suitable for both beginners and those looking to enhance their design skills.",
    "date": "6 October 2023",
    "location": "Room 511, 5th Floor, Building A, Navrachana University",
    "form_link": "",
    "btnText": ""
  },
  {
    "title": "Workshop Series: Unboxing Linux",
    "image_url": "assets/images/events/dsc-bevy-chapterevents-03_uDQbTVM.webp",
    "description": "Join us for a 2-hour journey into the world of Linux. Discover the essentials, from installation to command line mastery, in this beginner-friendly session.",
    "date": "29 September 2023",
    "location": "Auditorium, 5th Floor, Navrachna University",
    "form_link": "",
    "btnText": ""
  },
  {
    "title": "Google Cloud Study Jam - Info Session",
    "image_url": "assets/images/events/dsc-bevy-chapterevents-03_uDQbTVM.webp",
    "description": "Join us for an insightful Info Session on our upcoming Google Cloud Study Jam cohort! Discover how this community-driven learning experience can boost your cloud computing skills. Don't miss this chance to kickstart your journey with Google Cloud Platform!",
    "date": "23 September 2023",
    "location": "Online",
    "form_link": "",
    "btnText": ""
  },
  {
    "title": "Workshop Series: OOP and DSA Essentials - 2 Days to Mastery",
    "image_url": "assets/images/events/dsc-bevy-chapterevents-03_uDQbTVM.webp",
    "description": "We will explore the fundamental principles of Object-Oriented Programming (OOP), providing an understanding of topics like encapsulation, abstraction, polymorphism, and inheritance. We will also explore Data Structures and Algorithms (DSA) to understand different searching and sorting algorithms and other fundamental concepts.",
    "date": "22 September 2023",
    "location": "Room 511, Navrachana University",
    "form_link": "",
    "btnText": ""
  },
  {
    "title": "Workshop Series - Introduction To Programming Using C",
    "image_url": "assets/images/events/dsc-bevy-chapterevents-03_uDQbTVM.webp",
    "description": "Dive into the fundamentals of programming with an engaging introduction to C. Explore the syntax, logic, and structure that form the building blocks of coding in this beginner-friendly session.",
    "date": "2 September 2023",
    "location": "Room 511, Floor 5, Building A, Navrachana University",
    "form_link": "",
    "btnText": ""
  },
  {
    "title": "Exploring Career Pathways in CS and AI: GDSC NUV Info Session And \"Artificial Gamer\" Movie Screening",
    "image_url": "assets/images/events/dsc-bevy-chapterevents-03_uDQbTVM.webp",
    "description": "Discover diverse career paths in CS and AI! Join GDSC NUV for an info session, team intro, and \"Artificial Game\" documentary screening. Open to AI/ML enthusiasts, cinephiles, gamers, and all interested in tech careers.",
    "date": "28 August 2023",
    "location": "Room No 104, Building A, Navrachana University",
    "form_link": "",
    "btnText": ""
  }
]